In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\dell\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [4]:
import pandas as pd

In [5]:
import numpy as np

In [6]:
# dataset
data = data = {
    "student" : ["Bhuvan", "Gaurav", "Nitesh", "Ankush", "Jayesh"],
    "rank" : [1, 2, 3, 5, 4],
    "marks" : [95, 90, 85, 75, 82]
}
res = pd.DataFrame(data)

print("Student Records\n\n",res)

Student Records

   student  rank  marks
0  Bhuvan     1     95
1  Gaurav     2     90
2  Nitesh     3     85
3  Ankush     5     75
4  Jayesh     4     82

In [7]:
import pandas as pd
df = pd.read_csv("data.csv")

In [8]:
data = {
    "student" : ["Bhuvan", "Gaurav", "Nitesh", "Ankush", "Jayesh"],
    "rank" : [1, 2, 3, 5, 4],
    "marks" : [95, 90, 85, 75, 82]
}
df = pd.DataFrame(data)

df.to_csv("data.csv", index=False)
print("data.csv created successfully!")

data.csv created successfully!

In [9]:
df_loaded = pd.read_csv("data.csv")
print(df_loaded)

  student  rank  marks
0  Bhuvan     1     95
1  Gaurav     2     90
2  Nitesh     3     85
3  Ankush     5     75
4  Jayesh     4     82

In [10]:
df.head()

  student  rank  marks
0  Bhuvan     1     95
1  Gaurav     2     90
2  Nitesh     3     85
3  Ankush     5     75
4  Jayesh     4     82

In [11]:
df["rank"] = df["rank"].fillna(df["rank"].mean())
df["marks"] = df["marks"].fillna(0)

In [12]:
df["marks_in_10_sum"] = df["marks"] + 10

In [13]:
high_rank = df[df["rank"] > 90]

In [14]:
avg_marks = df.groupby("student")["marks"].mean()
print(avg_marks)

student
Ankush    75.0
Bhuvan    95.0
Gaurav    90.0
Jayesh    82.0
Nitesh    85.0
Name: marks, dtype: float64

In [15]:
pd.merge(df1, df2, on="student")

NameError: name 'df1' is not defined

In [16]:
import pandas as pd


df1 = pd.DataFrame({
    "student": ["Bhuvan", "Gaurav", "Nitesh", "Ankush", "Jayesh"],
    "rank": [1, 2, 3, 5, 4]
})

In [17]:
df2 = pd.DataFrame({
    "student": ["Bhuvan", "Gaurav", "Nitesh", "sham", "Jayesh"],
    "marks":[95, 90, 85, 75, 82]
})

In [18]:
merged = pd.merge(df1, df2, on="student")
print(merged)

  student  rank  marks
0  Bhuvan     1     95
1  Gaurav     2     90
2  Nitesh     3     85
3  Jayesh     4     82

In [19]:
 pd.merge(df1, df2, on="student", how="inner")

  student  rank  marks
0  Bhuvan     1     95
1  Gaurav     2     90
2  Nitesh     3     85
3  Jayesh     4     82

In [20]:
 pd.merge(df1, df2, on="student", how="left")

  student  rank  marks
0  Bhuvan     1   95.0
1  Gaurav     2   90.0
2  Nitesh     3   85.0
3  Ankush     5    NaN
4  Jayesh     4   82.0

In [21]:
 pd.merge(df1, df2, on="student", how="right")

  student  rank  marks
0  Bhuvan   1.0     95
1  Gaurav   2.0     90
2  Nitesh   3.0     85
3    sham   NaN     75
4  Jayesh   4.0     82

In [22]:
 pd.merge(df1, df2, on="student", how="outer")

  student  rank  marks
0  Ankush   5.0    NaN
1  Bhuvan   1.0   95.0
2  Gaurav   2.0   90.0
3  Jayesh   4.0   82.0
4  Nitesh   3.0   85.0
5    sham   NaN   75.0

In [23]:
student = {
     "Name": ["Amit", "Mukesh", "Ramesh", "Mahesh"],
    "Age": [25, 30, 35, 40],
    "Marks": [85, 90, 75, 95]
}
res = pd.DataFrame(student)

print("Student Records\n\n",res)

Student Records

      Name  Age  Marks
0    Amit   25     85
1  Mukesh   30     90
2  Ramesh   35     75
3  Mahesh   40     95

In [24]:
df = pd.DataFrame({
    "Name": ["Amit", "Mukesh", "Ramesh", "Mahesh"],
    "Age": [25, 30, 35, 40],
    "Marks": [85, 90, 75, 95]
})

In [25]:
student = {
     "Name": ["Amit", "Mukesh", "Ramesh", "Mahesh"],
    "Age": [25, 30, 35, 40],
    "Marks": [85, 90, 75, 95]
}
res = pd.DataFrame(student)

df.to_csv("student.csv", index=False)
print("student.csv created successfully!")

student.csv created successfully!

In [26]:
import pandas as pd
df = pd.read_csv("student.csv")

In [27]:
df.head()

     Name  Age  Marks
0    Amit   25     85
1  Mukesh   30     90
2  Ramesh   35     75
3  Mahesh   40     95

In [28]:
df.shape

(4, 3)

In [29]:
df.describe()

             Age      Marks
count   4.000000   4.000000
mean   32.500000  86.250000
std     6.454972   8.539126
min    25.000000  75.000000
25%    28.750000  82.500000
50%    32.500000  87.500000
75%    36.250000  91.250000
max    40.000000  95.000000

In [30]:
df["Marks"]

0    85
1    90
2    75
3    95
Name: Marks, dtype: int64

In [31]:
df.iloc

In [32]:
df[df["Marks"] > 80]

     Name  Age  Marks
0    Amit   25     85
1  Mukesh   30     90
3  Mahesh   40     95

In [33]:
df.loc[3, "Marks"] = None
print("\nAfter introducing NaN:")
print(df)

After introducing NaN:
     Name  Age  Marks
0    Amit   25   85.0
1  Mukesh   30   90.0
2  Ramesh   35   75.0
3  Mahesh   40    NaN

In [34]:
df["Marks"] = df["Marks"].fillna(df["Marks"].mean())
print("\nAfter filling NaN with average:")
print(df)

After filling NaN with average:
     Name  Age      Marks
0    Amit   25  85.000000
1  Mukesh   30  90.000000
2  Ramesh   35  75.000000
3  Mahesh   40  83.333333

In [35]:
df["Marks"] = df["Marks"].fillna(df["Marks"].median())
print(df)

     Name  Age      Marks
0    Amit   25  85.000000
1  Mukesh   30  90.000000
2  Ramesh   35  75.000000
3  Mahesh   40  83.333333

In [36]:
df["Marks"] = df["Marks"].fillna(df["Marks"].mode()[0])
print(df)

     Name  Age      Marks
0    Amit   25  85.000000
1  Mukesh   30  90.000000
2  Ramesh   35  75.000000
3  Mahesh   40  83.333333

In [37]:
df = pd.read_csv("student.csv")

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Marks   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [39]:
df.head

<bound method NDFrame.head of      Name  Age  Marks
0    Amit   25     85
1  Mukesh   30     90
2  Ramesh   35     75
3  Mahesh   40     95>

In [40]:
df.iloc()

In [41]:
df.loc

In [42]:
df.tail(5)

     Name  Age  Marks
0    Amit   25     85
1  Mukesh   30     90
2  Ramesh   35     75
3  Mahesh   40     95

In [43]:
df.sample(1)

     Name  Age  Marks
3  Mahesh   40     95

In [44]:
df.shape

(4, 3)

In [45]:
data = [10, 20, 30, 40, 50]

series = pd.Series(data, index=['a', 'b', 'c', 'd', 'e'])

In [46]:
series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [47]:
type(series)

pandas.core.series.Series

In [48]:
data = data = {
    "student" : ["Bhuvan", "Gaurav", "Nitesh", "Ankush", "Jayesh"],
    "rank" : [1, 2, 3, 5, 4],
    "marks" : [95, 90, 85, 75, 82]
}

In [49]:
df = pd.DataFrame(student)

In [50]:
df

     Name  Age  Marks
0    Amit   25     85
1  Mukesh   30     90
2  Ramesh   35     75
3  Mahesh   40     95

In [51]:
type(df)

pandas.core.frame.DataFrame

In [52]:
type(df.Name)

pandas.core.series.Series

In [53]:
df[[ "Name", "Age","Marks"]]

     Name  Age  Marks
0    Amit   25     85
1  Mukesh   30     90
2  Ramesh   35     75
3  Mahesh   40     95

In [54]:
df.describe

<bound method NDFrame.describe of      Name  Age  Marks
0    Amit   25     85
1  Mukesh   30     90
2  Ramesh   35     75
3  Mahesh   40     95>

In [55]:
df.describe(include="all")

        Name        Age      Marks
count      4   4.000000   4.000000
unique     4        NaN        NaN
top     Amit        NaN        NaN
freq       1        NaN        NaN
mean     NaN  32.500000  86.250000
std      NaN   6.454972   8.539126
min      NaN  25.000000  75.000000
25%      NaN  28.750000  82.500000
50%      NaN  32.500000  87.500000
75%      NaN  36.250000  91.250000
max      NaN  40.000000  95.000000

In [56]:
df.describe(include="all").T

      count unique   top freq   mean       std   min    25%   50%    75%   max
Name      4      4  Amit    1    NaN       NaN   NaN    NaN   NaN    NaN   NaN
Age     4.0    NaN   NaN  NaN   32.5  6.454972  25.0  28.75  32.5  36.25  40.0
Marks   4.0    NaN   NaN  NaN  86.25  8.539126  75.0   82.5  87.5  91.25  95.0

In [57]:
df.T

          0       1       2       3
Name   Amit  Mukesh  Ramesh  Mahesh
Age      25      30      35      40
Marks    85      90      75      95

In [58]:
df.T

          0       1       2       3
Name   Amit  Mukesh  Ramesh  Mahesh
Age      25      30      35      40
Marks    85      90      75      95

In [59]:
df["Age"].unique()

array([25, 30, 35, 40])

In [60]:
df["Name"].unique()

array(['Amit', 'Mukesh', 'Ramesh', 'Mahesh'], dtype=object)

In [61]:
df["Marks"].unique()

array([85, 90, 75, 95])

In [62]:
df["Age"].value_counts()

Age
25    1
30    1
35    1
40    1
Name: count, dtype: int64

In [63]:
df["Name"].value_counts()

Name
Amit      1
Mukesh    1
Ramesh    1
Mahesh    1
Name: count, dtype: int64

In [64]:
df["Marks"].value_counts()

Marks
85    1
90    1
75    1
95    1
Name: count, dtype: int64

In [65]:
df.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [66]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [67]:
print(df['Age'].mean())       # Mean
print(df['Age'].median())     # Median
print(df['Age'].mode())       # Mode
print(df['Age'].std())        # Standard deviation
print(df['Age'].var())        # Variance
print(df['Age'].min())        # Minimum
print(df['Age'].max())        # Maximum
print(df['Age'].quantile(0.25))  # 25th percentile

32.5
32.5
0    25
1    30
2    35
3    40
Name: Age, dtype: int64
6.454972243679028
41.666666666666664
25
40
28.75

In [68]:
print(df['Marks'].nunique())         # Number of unique values

4

In [69]:
df.isnull().sum() # Count of missing values

Name     0
Age      0
Marks    0
dtype: int64

In [70]:
df.isna().sum()

Name     0
Age      0
Marks    0
dtype: int64

In [71]:
print(df.notnull().sum())

Name     4
Age      4
Marks    4
dtype: int64

In [72]:
df.loc[1:4:1,["Name","Age","Marks"]]

     Name  Age  Marks
1  Mukesh   30     90
2  Ramesh   35     75
3  Mahesh   40     95

In [73]:
df1 = df.copy()

In [74]:
df1.head()

     Name  Age  Marks
0    Amit   25     85
1  Mukesh   30     90
2  Ramesh   35     75
3  Mahesh   40     95

In [76]:
df1.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [77]:
df1.isnull().sum()

Name     0
Age      0
Marks    0
dtype: int64

In [79]:
df1.dtypes

Name     object
Age       int64
Marks     int64
dtype: object

In [81]:
df1.duplicated().sum()

np.int64(0)

In [83]:
df1.describe(include="all").T

      count unique   top freq   mean       std   min    25%   50%    75%   max
Name      4      4  Amit    1    NaN       NaN   NaN    NaN   NaN    NaN   NaN
Age     4.0    NaN   NaN  NaN   32.5  6.454972  25.0  28.75  32.5  36.25  40.0
Marks   4.0    NaN   NaN  NaN  86.25  8.539126  75.0   82.5  87.5  91.25  95.0

In [87]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana','Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [25, 30, 35, 28, 18, 23, 40, 35],
    'City': ['New York', 'London', 'Tokyo', 'Paris','New York', 'London', 'Tokyo', 'Paris'],
    'Salary': [70000, 80000, 90000, 75000, 30000, 40000, 90000, 15000]
}

In [89]:
df = pd.DataFrame(data)

In [91]:
df

      Name  Age      City  Salary
0    Alice   25  New York   70000
1      Bob   30    London   80000
2  Charlie   35     Tokyo   90000
3    Diana   28     Paris   75000
4    Alice   18  New York   30000
5      Bob   23    London   40000
6  Charlie   40     Tokyo   90000
7    Diana   35     Paris   15000

In [93]:
df[df["Age"] > 30]

      Name  Age   City  Salary
2  Charlie   35  Tokyo   90000
6  Charlie   40  Tokyo   90000
7    Diana   35  Paris   15000

In [102]:
df[(df["Age"] > 30) & (df["City"] == "Tokyo")]

      Name  Age   City  Salary
2  Charlie   35  Tokyo   90000
6  Charlie   40  Tokyo   90000

In [106]:
df[(df["Age"] > 30) | (df["City"] == "New York")]

      Name  Age      City  Salary
0    Alice   25  New York   70000
2  Charlie   35     Tokyo   90000
4    Alice   18  New York   30000
6  Charlie   40     Tokyo   90000
7    Diana   35     Paris   15000

In [107]:
# Using isin() method
df[df['City'].isin(["New York"])]

    Name  Age      City  Salary
0  Alice   25  New York   70000
4  Alice   18  New York   30000

In [108]:
# String operations in boolean indexing
print(df[df['Name'].str.contains('C')])    # Names containing 'C'

      Name  Age   City  Salary
2  Charlie   35  Tokyo   90000
6  Charlie   40  Tokyo   90000

In [109]:
# String operations in boolean indexing
print(df[df['Name'].str.contains('A')])    # Names containing 'A'

    Name  Age      City  Salary
0  Alice   25  New York   70000
4  Alice   18  New York   30000

In [110]:
df_str = pd.DataFrame({
    'names': ['John  ', 'Bhuvan', 'champ', 'DIANA'],
    'emails': ['John@email.com', 'bhuvan@COMPANY.COM', 'champ@email.com', 'diana@company.com']
})

In [111]:
df_str

    names              emails
0  John        John@email.com
1  Bhuvan  bhuvan@COMPANY.COM
2   champ     champ@email.com
3   DIANA   diana@company.com

In [112]:
# String manipulation
print(df_str['names'].str.replace('a', 'A'))   # Replace characters

0    John
1    BhuvAn
2     chAmp
3     DIANA
Name: names, dtype: object

In [1]:
for i in range(ord("A"), ord("Z")):
    print(chr(i), end = " ")

A B C D E F G H I J K L M N O P Q R S T U V W X Y

In [2]:
dict1 = {"name": "jasmine", "class":["a",3,"b",6]}

In [3]:
dict1

{'name': 'jasmine', 'class': ['a', 3, 'b', 6]}

In [4]:
numbers = [1,2,3,4,5]
names = ["Bhuvan", "Gaurav", "Nitesh", "Ankush", "Jayesh"]

my_dict = dict(zip(numbers, names))
print(my_dict)

{1: 'Bhuvan', 2: 'Gaurav', 3: 'Nitesh', 4: 'Ankush', 5: 'Jayesh'}

In [2]:
def create_dictionary(numbers, names):
    my_dict = {}
    for num, name in zip(numbers, names):
        my_dict[num] = name
    return my_dict

numbers = [1,2,3,4,5]
names = ["Bhuvan", "Gaurav", "Nitesh", "Ankush", "Jayesh"]

result = create_dictionary(numbers, names)
print(result)

{1: 'Bhuvan', 2: 'Gaurav', 3: 'Nitesh', 4: 'Ankush', 5: 'Jayesh'}